{"modelTopology":{"class_name":"Model","config":{"name":"decoder","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,8],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"decoder_output","class_name":"Dense","config":{"units":784,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"decoder_output","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["decoder_output",0,0]]},"keras_version":"tfjs-layers 4.0.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"decoder_output/kernel","shape":[8,784],"dtype":"float32"},{"name":"decoder_output/bias","shape":[784],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.0.0","convertedBy":null}