{"modelTopology":{"class_name":"Model","config":{"name":"autoencoder","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,784],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"encoder","class_name":"Model","config":{"name":"encoder","layers":[{"name":"encoder_input","class_name":"InputLayer","config":{"batch_input_shape":[null,784],"dtype":"float32","sparse":false,"name":"encoder_input"},"inbound_nodes":[]},{"name":"encoder_output","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"encoder_output","trainable":true},"inbound_nodes":[[["encoder_input",0,0,{}]]]}],"input_layers":[["encoder_input",0,0]],"output_layers":[["encoder_output",0,0]]},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"decoder","class_name":"Model","config":{"name":"decoder","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,8],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"decoder_output","class_name":"Dense","config":{"units":784,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"decoder_output","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["decoder_output",0,0]]},"inbound_nodes":[[["encoder",1,0,{}]]]}],"input_layers":[["input2",0,0]],"output_layers":[["decoder",1,0]]},"keras_version":"tfjs-layers 4.0.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"encoder_output/kernel","shape":[784,8],"dtype":"float32"},{"name":"encoder_output/bias","shape":[8],"dtype":"float32"},{"name":"decoder_output/kernel","shape":[8,784],"dtype":"float32"},{"name":"decoder_output/bias","shape":[784],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.0.0","convertedBy":null}