{"modelTopology":{"class_name":"Model","config":{"name":"encoder","layers":[{"name":"encoder_input","class_name":"InputLayer","config":{"batch_input_shape":[null,784],"dtype":"float32","sparse":false,"name":"encoder_input"},"inbound_nodes":[]},{"name":"encoder_output","class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"encoder_output","trainable":true},"inbound_nodes":[[["encoder_input",0,0,{}]]]}],"input_layers":[["encoder_input",0,0]],"output_layers":[["encoder_output",0,0]]},"keras_version":"tfjs-layers 4.0.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"encoder_output/kernel","shape":[784,8],"dtype":"float32"},{"name":"encoder_output/bias","shape":[8],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.0.0","convertedBy":null}